A = str(input("Цвет 1 "))
B = str(input("Цвет 2 "))
if (A == "красный" or A == "синий" or A == "жёлтый") and (B == "красный" or B == "синий" or B == "жёлтый") and A != B:
    if (A == "красный" or A == "синий") and (B == "красный" or B == "синий"):
        print("фиолетовый")
    elif (A == "синий" or A == "жёлтый") and (B == "синий" or B == "жёлтый"):
        print("зелёный")
    elif (A == "красный" or A == "жёлтый") and (B == "красный" or B == "жёлтый"):
        print("оранжевый")
else:
    print("Иди в садик")