import random

List_1 = ("Смирнов", "Сидорова", "Иванов", "Семёнова", "Калашников", "Носов", "Позов", "Петушков", "Рыжков", "Самохин")
List_2 = ("Маркин", "Тимофеев", "Вольнов", "Гуменюк", "Денисов", "Ермаков", "Зуев", "Лебедев", "Морошкин", "Морозов")

A = list(List_1)
B = list(List_2)
random.shuffle(A)
random.shuffle(B)
S1 = tuple(A)
S2 = tuple(B)

C = S1[:5] + S2[:5]

CL = tuple(sorted(C))

print("Состав команды:", *C)
print("Моя группа:", *List_1)
print("Другая группа:", *List_2)
print("Длина кортежа:", len(C))
print("Отсортированный кортеж::", *CL)


if "Иванов" in C:
      print("Иванов в команде")
else:
      print("Иванов не в команде")
